from Student import Student
from UNI import UNI
#-----------------------------------------
from C_IELTS import C_IELTS 
from C_TOEFL import C_TOEFL
#-----------------------------------------



#Информация: 
def information():
  from datetime import date
  today = date.today()
  print("  Добре дошли!")
  print("Днес е:", today)
  print("\n")

information()

#----------------------------------------------------------------------
#Видове сертификати:

#IELTS
B2_1 = C_IELTS("B2", "ENGLISH")
C1_1 = C_IELTS("C1", "ENGLISH")
C2_1 = C_IELTS("C2", "ENGLISH")

#TOEFL
B2_2 = C_TOEFL("B2", "ENGLISH")
C1_2 = C_TOEFL("C1", "ENGLISH")
C2_2 = C_TOEFL("C2", "ENGLISH")

#--------------------------------------------
#Данни на всички кандидатствали студенти:

#факултетен номер, име, фамилия, университет, оценка от зимен семестър,оценка от летен семестър, сертификат(ако е наличен):
student1 = Student(15311042, "Спас Иванов", "BFU", 6.0, 5.3)
student2 = Student(18314789, "Михаела Георгиева", "BFU", 4.0, 4.6, C1_1)
student3 = Student(18357896, "Виктория Николова", "AS-ZL-UNI", 6.0, 3.1)
student4 = Student(25674587, "Моника Златкова", "AS-ZL-UNI", 4.6, 5.7, C2_1)
student5 = Student(35648248, "Петър Петров", "BFU", 5.2, 5.7, B2_2)

#----------------------------------------------------------------------

#Разпределение на кандидатствалите студенти по университети:
BFU_students = [student1, student2, student5]
ASZL_students = [student3, student4]
#Всички студенти:
ALL_students  = [student1, student2, student3, student4, student5]

#-----------------------------------------------------------------------
#Информация за университетите включени в програмата:

# 1)Бургаски свободен университет
BFU = UNI(BFU_students, "BFU", "Галя Христозова",105)
# 2)Асен Златаров
ASZL = UNI(ASZL_students, "AS-ZL-UNI", "Магдалена Миткова",102)

#-----------------------------------------------------------------------
# Изписване на надпис:
a = "Р Е З У Л Т А Т И" 
b = a.center(24, "-")
print("\t" + b )
print("\n")
#------------------------------------------------------
#Изписване на кандидатствалите студенти и техния резултат: 

#Студенти от БСУ - статус(одобрен или неодобрен)
print('\x1b[6;30;42m' +' СТУДЕНТИ НА БУРГАСКИ СВОБОДЕН УНИВЕРСИТЕТ:' + '\x1b[0m'"\n")
BFU.print_uni()

#Студенти от Асен Златаров - статус(одобрен или неодобрен)
print('\x1b[6;30;42m' +' СТУДЕНТИ НА АСЕН ЗЛАТАРОВ:' + '\x1b[0m'"\n")
ASZL.print_uni()

#-----------------------------------------------------------------------------
#СТАТИСТИЧЕСКА ИНФОРМАЦИЯ:

# Изписване на надпис:
c = " СТАТИСТИЧЕСКА ИНФОРМАЦИЯ " 
d = c.center(30, "*")
print("\t" + d  )
print("\n")
#--------------------------------

print("--> БУРГАСКИ СВОБОДЕН УНИВЕРСИТЕТ")
# 1)Среден успех на БСУ:
BFU.get_avg()
# 2)Брой кандидатствали студенти от БСУ:
BFU.get_num()
# 3)Процент(кандидатствали) от общия брой на БСУ:
BFU.get_percent()

#--------------------------------
print("\n")
#--------------------------------

print("--> АСЕН ЗЛАТАРОВ")
# 1)Среден успех на АСЕН ЗЛАТАРОВ:
ASZL.get_avg()
# 2)Брой кандидатствали студенти от АСЕН ЗЛАТАРОВ:
ASZL.get_num()
# 3)Процент(кандидатствали) от общия брой на АСЕН ЗЛАТАРОВ:
ASZL.get_percent()





